Revit 2024 API
MechanicalFitting.PartType Property
The part type of the mechanical fitting.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PartType PartType { get; }
Visual Basic
Public ReadOnly Property PartType As PartType
	Get
Visual C++
public:
property PartType PartType {
	PartType get ();
}
See Also
MechanicalFitting Class
Autodesk.Revit.DB.Mechanical Namespace